Revit 2027 API
FilterDoubleRule.Epsilon Property
 The tolerance within which two floating-point values may be considered equal.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Epsilon { get; set; }
Public Property Epsilon As Double
	Get
	Set
public:
property double Epsilon {
	double get ();
	void set (double value);
}
member Epsilon : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The given value for epsilon is not finite -or- When setting this property: The given value for epsilon is not a number
See Also
Reference
FilterDoubleRule Class
Autodesk.Revit.DB Namespace